src/cf/AccumulationRegisters/РасходыНаОнлайнКассыУменьшающиеНалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасходыНаОнлайнКассыУменьшающиеНалоги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасхода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходыНаОнлайнКассыУменьшающиеНалоги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговУменьшаемыхНаРасходыККТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВидыНалоговУменьшаемыхНаРасходыККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНалоговУменьшаемыхНаРасходыККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Патент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/AccumulationRegisters/РасходыНаОнлайнКассыУменьшающиеНалоги/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сведения о зарегистрированных и учтенных в налоге суммах расходов на онлайн-кассы за квартал.
//
// Параметры:
//  Организация                 - СправочникСсылка.Организации - организация
//  Период                      - Дата - дата в квартале, за который определяются суммы расходов
//  РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - регистрация в налоговом органе,
//                                   для которой определяются суммы расходов.
//                                   Если не указана - расходы будут получены по всем регистрациям
//
// Возвращаемое значение:
//   См. НовыйОписаниеСуммРасходовНаОнлайнКассы
//
Функция СуммыРасходовЗаПериод(Организация, Период, РегистрацияВНалоговомОргане = Неопределено) Экспорт
	
	Расходы = НовыйОписаниеСуммРасходовНаОнлайнКассы();
	
	Если Не ЗначениеЗаполнено(Период) Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Расходы;
	КонецЕсли;
	
	Если НЕ ВычетыНаОнлайнКассыКлиентСервер.ВычетыПрименяются(Организация, 
															  Период, 
															  Перечисления.ВидыНалоговУменьшаемыхНаРасходыККТ.УСН)  Тогда
		Возврат Расходы;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.Зарегистрировано), 0) КАК РасходыНаОнлайнКассыВсего,
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.УчтеноРанее), 0) КАК РасходыНаОнлайнКассыУчтеноРанее,
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.Зарегистрировано), 0) - ЕСТЬNULL(СУММА(ВложенныйЗапрос.УчтеноРанее), 0) КАК РасходыНаОнлайнКассыНачальныйОстаток,
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.УчтеноЗаКвартал), 0) КАК НалоговыйВычетОнлайнКассы,
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.КонечныйОстаток), 0) КАК РасходыНаОнлайнКассыКонечныйОстаток
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходыНаОнлайнКассыЗаКвартал.СуммаПриход КАК Зарегистрировано,
	|		0 КАК УчтеноРанее,
	|		РасходыНаОнлайнКассыЗаКвартал.СуммаРасход КАК УчтеноЗаКвартал,
	|		РасходыНаОнлайнКассыЗаКвартал.СуммаКонечныйОстаток КАК КонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасходыНаОнлайнКассыУменьшающиеНалоги.ОстаткиИОбороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				,
	|				Организация = &Организация
	|					И &УсловиеРегистрацияВНалоговомОргане
	|					И СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговУменьшаемыхНаРасходыККТ.УСН)) КАК РасходыНаОнлайнКассыЗаКвартал
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходыНаКассовуюТехникуУчтенныеРанее.СуммаПриход,
	|		РасходыНаКассовуюТехникуУчтенныеРанее.СуммаРасход,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасходыНаОнлайнКассыУменьшающиеНалоги.Обороты(
	|				,
	|				&КонецПредыдущегоПериода,
	|				,
	|				Организация = &Организация
	|					И &УсловиеРегистрацияВНалоговомОргане
	|					И СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговУменьшаемыхНаРасходыККТ.УСН)) КАК РасходыНаКассовуюТехникуУчтенныеРанее) КАК ВложенныйЗапрос"
	;
	
	Запрос.УстановитьПараметр("Организация",             Организация);
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода", НачалоКвартала(Период) - 1);
	Запрос.УстановитьПараметр("НачалоПериода",           НачалоКвартала(Период));
	Запрос.УстановитьПараметр("КонецПериода",            КонецКвартала(Период));
	
	Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРегистрацияВНалоговомОргане",
			"РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРегистрацияВНалоговомОргане", "ИСТИНА");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Расходы, Выборка);
	КонецЕсли;
	
	Возврат Расходы;
	
КонецФункции

// Получает общую сумму зарегистрированных расходов на онлайн-кассы за весь период до переданной даты,
// включая саму дату (секунду даты).
//
// Параметры:
//  Организация                 - СправочникСсылка.Организации - организация
//  ГраницаПериода              - Дата - дата, по которую определяется сумма расходов (включая ее саму)
//  СистемаНалогообложения 		- ПеречислениеСсылка.ТипыСистемНалогообложенияККТ,
//  РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацииВНалоговомОргане - регистрация в налоговом органе,
//                                   для которой определяются расходы. Если не указана - по всем регистрациям.
//
// Возвращаемое значение:
//   Число   - сумма зарегистрированных пользователем расходов на приобретение онлайн-касс
//
Функция ЗарегистрированоВсего(Организация, ГраницаПериода, СистемаНалогообложения, РегистрацияВНалоговомОргане = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Или Не ЗначениеЗаполнено(ГраницаПериода) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходыНаОнлайнКассыОбороты.СуммаПриход КАК ВсегоРасходов
	|ИЗ
	|	РегистрНакопления.РасходыНаОнлайнКассыУменьшающиеНалоги.Обороты(
	|			,
	|			&ГраницаПериода,
	|			,
	|			Организация = &Организация
	|				И &УсловиеРегистрацияВНалоговомОргане
	|				И СистемаНалогообложения = &СистемаНалогообложения) КАК РасходыНаОнлайнКассыОбороты"
	;
	
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("ГраницаПериода", ГраницаПериода);
	Запрос.УстановитьПараметр("СистемаНалогообложения", СистемаНалогообложения);
	
	Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРегистрацияВНалоговомОргане",
			"РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеРегистрацияВНалоговомОргане", "ИСТИНА");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВсегоРасходов;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Возвращает информацию по суммам расходов на онлайн-кассы, использованным за указанный период
// для вычетов по налоговым платежам
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  ДатаНачала - Дата
//  ДатаОкончания - Дата
//  ВидНалога - ПеречислениеСсылка.ВидыНалоговУменьшаемыхНаРасходыККТ
//
// Возвращает стурктуру с суммами за период
//
// Возвращаемое значение:
// См. НовыйИнформацияПоСуммамРасходов
//
Функция ИнформацияПоСуммамРасходовЗаПериод(Организация, ДатаНачала, ДатаОкончания, ВидНалога) Экспорт
	
	Результат = НовыйИнформацияПоСуммамРасходов();
	
	Если Не Истина Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстаткиИОбороты.СуммаПриход КАК Приход,
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстаткиИОбороты.ДокументРасхода КАК ДокументРасхода,
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстаткиИОбороты.СуммаНачальныйОстаток +
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстаткиИОбороты.СуммаПриход КАК ВсегоРасходов,
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстаткиИОбороты.СуммаРасход КАК ИспользованныйВычет,
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстаткиИОбороты.СуммаКонечныйОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.РасходыНаОнлайнКассыУменьшающиеНалоги.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания,,,
		|		Организация = &Организация
		|	И СистемаНалогообложения = &ВидНалога) КАК РасходыНаОнлайнКассыУменьшающиеНалогиОстаткиИОбороты";
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаНачала", "");
	Иначе
		Запрос.УстановитьПараметр("ДатаНачала", Новый Граница(ДатаНачала, ВидГраницы.Включая));	
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаОкончания", "");
	Иначе	
		Запрос.УстановитьПараметр("ДатаОкончания", Новый Граница(ДатаОкончания, ВидГраницы.Включая));
	КонецЕсли;

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидНалога", ВидНалога);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
// Параметры:
//   Ограничение - Произвольный
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Записывает или перезаписывает существующую запись регистра, переданной суммой в качестве параметра
//
//
// Параметры:
//   Источник 			- ДокументОбъект
//   СуммаРасхода 		- Число
//   Период				- Дата
//   РежимПроведения 	- РежимПроведенияДокумента
//   Отказ 				- Булево
//
// Возвращаемое значение:
//   Булево
//
Функция ОтражениеПогашенияСуммыВычетаЗаПриобретениеККТ(Источник, СуммаРасхода, Период, РежимПроведения, Отказ) Экспорт
	
	// Выполняем поиск уже существующей записи в выбранном периоду существующего документа
	
	СтруктураПоиска = Новый Структура("Период, ВидДвижения", Период, ВидДвиженияНакопления.Расход);
	
	ДвиженияДокумента = Источник.Движения;
	НаборЗаписей = ДвиженияДокумента.РасходыНаОнлайнКассыУменьшающиеНалоги; 
	НаборЗаписей.Прочитать();
	СуществующиеЗаписи = НаборЗаписей.Выгрузить().НайтиСтроки(СтруктураПоиска);
	
	НачатьТранзакцию();
	ДвиженияИзменены = Ложь;
	
	Если СуществующиеЗаписи.Количество() = 0  Тогда
		Если СуммаРасхода <> 0 Тогда 
			Движение = НаборЗаписей.ДобавитьРасход();
			
			ЗаполнитьЗначенияСвойств(Движение, Источник);
			Движение.Сумма = СуммаРасхода;
			Движение.ДокументРасхода = Источник.Ссылка;
			Движение.Период = Период; 
			Движение.Регистратор = Источник.Ссылка;
			Движение.СистемаНалогообложения = Перечисления.ВидыНалоговУменьшаемыхНаРасходыККТ.УСН;
			ДвиженияИзменены = Истина;
		КонецЕсли;
	Иначе
		Для Каждого Запись Из СуществующиеЗаписи Цикл
			
			Если Запись.Сумма <> СуммаРасхода Тогда 
				Движение = НаборЗаписей[Запись.НомерСтроки - 1]; 
				ЗаполнитьЗначенияСвойств(Движение, Источник);
				Движение.Сумма = СуммаРасхода;
				Движение.Период = Период; 
				Движение.Регистратор = Источник.Ссылка;
				Движение.СистемаНалогообложения = Перечисления.ВидыНалоговУменьшаемыхНаРасходыККТ.УСН;
				ДвиженияИзменены = Истина;
            КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДвиженияИзменены Тогда
		
		НаборЗаписей.Записать(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстатки.Организация.Представление КАК Организация,
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстатки.ДокументРасхода.Представление КАК ДокументРасхода,
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстатки.СистемаНалогообложения КАК СистемаНалогообложения,
		|	- РасходыНаОнлайнКассыУменьшающиеНалогиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасходыНаОнлайнКассыУменьшающиеНалоги.Остатки(, РегистрацияВНалоговомОргане = &ДокументРасхода) КАК РасходыНаОнлайнКассыУменьшающиеНалогиОстатки
		|ГДЕ
		|	РасходыНаОнлайнКассыУменьшающиеНалогиОстатки.СуммаОстаток > 0";
		
		Запрос.УстановитьПараметр("ДокументРасхода", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Отказ = Истина;
			
			ШаблонСообщения = НСтр("ru = 'Для организации %1 по документу расхода %2 за приобретение ККТ недостаточно суммы вычета в размере %3'"); 
			                      
			ТекстСообщения = СтрШаблон(ШаблонСообщения,
			Выборка.Организация,
			Выборка.ДокументРасхода,
			Выборка.СуммаОстаток);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Источник, , , Отказ);
			
		КонецЦикла;
	КонецЕсли;  
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает стурктуру с пустыми суммами
//
// Возвращаемое значение:
//   Структура:
//   	* РасходыНаОнлайнКассыВсего				- Число
//   	* РасходыНаОнлайнКассыУчтеноРанее		- Число
//   	* РасходыНаОнлайнКассыНачальныйОстаток	- Число
//   	* НалоговыйВычетОнлайнКассы				- Число
//   	* РасходыНаОнлайнКассыКонечныйОстаток	- Число
//
Функция НовыйОписаниеСуммРасходовНаОнлайнКассы()
	
	Расходы = Новый Структура;
	
	Расходы.Вставить("РасходыНаОнлайнКассыВсего",            0); // Всего зарегистрированных расходов, включая текущий период.
	Расходы.Вставить("РасходыНаОнлайнКассыУчтеноРанее",      0); // Расходы, учтенные в уменьшении налога за предыдущие периоды
	Расходы.Вставить("РасходыНаОнлайнКассыНачальныйОстаток", 0); // Расходы, которые можно учесть в уменьшении налога текущего периода: остаток на начало периода + сумма зарегистрированных за текущий период.
	расходы.Вставить("НалоговыйВычетОнлайнКассы",            0); // Расходы, учтенные в уменьшении налога за текущий период.
	Расходы.Вставить("РасходыНаОнлайнКассыКонечныйОстаток",  0); // Остаток неучтенных расходов - переносится в следующий период.
	
	Возврат Расходы;
	
КонецФункции

// Возвращает стурктуру с пустыми суммами
//
// Возвращаемое значение:
//   Структура:
//   	* ВсегоРасходов				- Число
//   	* ИспользованныйВычет		- Число
//   	* Остаток					- Число
//   	* ДокументРасхода			- Неопределено
//
Функция НовыйИнформацияПоСуммамРасходов()
	
	Результат = Новый Структура;
	Результат.Вставить("ВсегоРасходов", 		0);
	Результат.Вставить("ИспользованныйВычет",	0);
	Результат.Вставить("Остаток", 				0);
	Результат.Вставить("ДокументРасхода",		 Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
